homeworks/hw4.md

# Table of Contents

1.  [Problem 1:](#org9536f13)
2.  [Problem 2:](#orgb3c4748)
3.  [Problem 3](#orgc9fe25f)
4.  [Problem 4](#org16f5bba)
5.  [Problem 5](#org58c90e3)

This homework data set depends on this data set:

<https://www.kaggle.com/yersever/500-person-gender-height-weight-bodymassindex?select=500_Person_Gender_Height_Weight_Index.csv>

Please submit this homework by creating an RMD file in your project1
git repo. The RMD should run in the project1 docker environment. You
may need to install the gbm package.


<a id="org9536f13"></a>

# Problem 1:

Build a glm in R to classifier individuals as either Male or Female
based on their weight and height.

What is the accuracy of the model?


<a id="orgb3c4748"></a>

# Problem 2:

Use the 'gbm' package to train a similar model. Don't worry about
hyper parameter tuning for now. 

What is the accuracy of the model?


<a id="orgc9fe25f"></a>

# Problem 3

Filter the data set so that it contains only 50 Male examples. Create
a new model for this data set. What is the F1 Score of the model? 


<a id="org16f5bba"></a>

# Problem 4

For the model in the previous example plot an ROC curve. What does
this ROC curve mean?


<a id="org58c90e3"></a>

# Problem 5

Using K-Means, cluster the same data set. Can you identify the
clusters with the known labels? Provide an interpretation of this
result.

